Examinator/src/DataProcessors/ИмпортСтудентовОО/ИмпортСтудентовОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИмпортСтудентовОО</name>
  <attributes>
    <name>ТипИнформационнойБазыДляПодключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИнформационнойБазыНаСервереДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindowsИнформационнойБазыДляПодключения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольИнформационнойБазыДляПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗагрузкаСтудентов</name>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Специализация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПользователей</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отделение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходВПрограммуРазрешен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияСтандартная</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияOpenID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АутентификацияВебКабинета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрещеноИзменятьПароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьВСпискеВыбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьДоступаВДнях</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроведенияПрограммыОбучения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНовости</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Examinator/src/DataProcessors/ИмпортСтудентовОО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Устанавливает параметры загрузки.
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   ПолноеИмяТабличнойЧасти   – Строка – полное имя табличной части, в которую загружаются данные.
//   АдресЗагружаемыхДанных    – Строка – адрес временного хранилища с таблицей значений, в которой
//                                          находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор – Число – порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления – Строка – адрес временного хранилища с пустой таблицей значений,
//                                          являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей – ТаблицаЗначений – список неоднозначных значений, для которых в ИБ имеется несколько подходящих вариантов.
//       * Колонка       – Строка – имя колонки, в которой была обнаружена неоднозначность;
//       * Идентификатор – Число  – идентификатор строки, в которой была обнаружена неоднозначность.
//   ДополнительныеПараметры   – ЛюбойТип – Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	Студенты =  ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления);
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных);
	
	Для каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		
		Студент = Студенты.Добавить();
		Студент.ПолноеИмя = СокрЛП(СтрокаТаблицы.ПолноеИмя);
		Студент.Имя = СокрЛП(СтрокаТаблицы.Имя);
		Студент.ЭлектроннаяПочта = СокрЛП(СтрокаТаблицы.ЭлектроннаяПочта);
		Студент.Телефон = СокрЛП(СтрокаТаблицы.Телефон);		
		Студент.Код = СокрЛП(СтрокаТаблицы.Код);
		
		Студент.Курс = СокрЛП(СтрокаТаблицы.Курс);
		Студент.УчебнаяГруппа = СокрЛП(СтрокаТаблицы.УчебнаяГруппа);
		Студент.Статус = СокрЛП(СтрокаТаблицы.Статус);
		Студент.Специализация = СокрЛП(СтрокаТаблицы.Специализация);
		Студент.Специальность = СокрЛП(СтрокаТаблицы.Специальность);
		Студент.ФормаОбучения = СокрЛП(СтрокаТаблицы.ФормаОбучения);
		Студент.Отделение = СокрЛП(СтрокаТаблицы.Отделение);
		
		Студент.ГруппаПользователей = СокрЛП(СтрокаТаблицы.ГруппаПользователей);
		
		Студент.ВходВПрограммуРазрешен = СокрЛП(СтрокаТаблицы.ВходВПрограммуРазрешен);
		Студент.АутентификацияСтандартная = СокрЛП(СтрокаТаблицы.АутентификацияСтандартная);
		Студент.АутентификацияОС = СокрЛП(СтрокаТаблицы.АутентификацияОС);
		Студент.АутентификацияOpenID = СокрЛП(СтрокаТаблицы.АутентификацияOpenID);
		Студент.АутентификацияВебКабинета = СокрЛП(СтрокаТаблицы.АутентификацияВебКабинета);
		Студент.ГруппаДоступа = СокрЛП(СтрокаТаблицы.ГруппаДоступа);
		Студент.Пароль = СокрЛП(СтрокаТаблицы.Пароль);
		Студент.ЗапрещеноИзменятьПароль = СокрЛП(СтрокаТаблицы.ЗапрещеноИзменятьПароль);
		Студент.ПользовательОС = СокрЛП(СтрокаТаблицы.ПользовательОС);
		Студент.ПоказыватьВСпискеВыбора = СокрЛП(СтрокаТаблицы.ПоказыватьВСпискеВыбора);
		Студент.ПродолжительностьДоступаВДнях = СокрЛП(СтрокаТаблицы.ПродолжительностьДоступаВДнях);
		Студент.НомерПроведенияПрограммыОбучения = СокрЛП(СтрокаТаблицы.НомерПроведенияПрограммыОбучения);
		Студент.НомерНовости = СокрЛП(СтрокаТаблицы.НомерНовости);
		Студент.Организатор = СокрЛП(СтрокаТаблицы.Организатор);

		
		// Ищем пользователя
		
		НайденныеПользователи = Новый Массив;
		
		// Сначала ищем по коду
		
		Если ЗначениеЗаполнено(Студент.Код) Тогда
			ПользователиПоКоду = ОбщегоНазначенияСУ.НайтиВсехПользователей("Код", Студент.Код);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеПользователи, ПользователиПоКоду, Истина);
		КонецЕсли;
		
		// Ищем по полному имени
		
		Если НайденныеПользователи.Количество() = 0 И ЗначениеЗаполнено(Студент.ПолноеИмя) Тогда
			ПользователиПоНаименованию = ОбщегоНазначенияСУ.НайтиВсехПользователей("Наименование", Студент.ПолноеИмя);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеПользователи, ПользователиПоНаименованию, Истина);
		КонецЕсли;
		
		// Определяем пользователя
		
		Если НайденныеПользователи.Количество() = 1 Тогда
			Студент.Пользователь = НайденныеПользователи[0];
		ИначеЕсли НайденныеПользователи.Количество() > 1 Тогда
			Студент.Пропустить = Истина;
		КонецЕсли;
			
	КонецЦикла;

	ПоместитьВоВременноеХранилище(Студенты, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//   ПолноеИмяТабличнойЧасти  – Строка – Полное имя табличной части, в которую загружаются данные.
//     ИмяКолонки               – Строка – Имя колонки, в который возникла неоднозначность. 
//  СписокНеоднозначностей    – Массив  – Массив для заполнения с неоднозначными данными.
//  ЗагружаемыеЗначенияСтрока – Строка  – Загружаемые данные, на основании которых возникла неоднозначность.
//  ДополнительныеПараметры   – ЛюбойТип – Любые дополнительные сведения
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
КонецПроцедуры

#КонецОбласти

#КонецЕсли
